## Production: cloudwatch_alarms

**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`  

**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show Plan</summary>

```terraform
aws_cloudwatch_metric_alarm.metrics_api_gateway_min_invocations_threshold: Refreshing state... [id=metrics-api-gateway-below-minimum-invocations]
aws_cloudwatch_metric_alarm.metrics_api_gateway_500_errors_above_threshold: Refreshing state... [id=metrics-api-gateway-errors-above-threshold]
aws_cloudwatch_metric_alarm.metrics_api_gateway_max_invocations_threshold[0]: Refreshing state... [id=metrics-api-gateway-above-maximum-invocations]
aws_cloudwatch_metric_alarm.metrics_api_gateway_max_latency_threshold: Refreshing state... [id=metrics-api-gateway-above-maximum-latency]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.metrics_api_gateway_400_errors_above_threshold will be created
  + resource "aws_cloudwatch_metric_alarm" "metrics_api_gateway_400_errors_above_threshold" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:820252213580:alert-critical",
        ]
      + alarm_description                     = "This metric monitors 400 errors in the metrics API gateway"
      + alarm_name                            = "metrics-api-gateway-400-errors-above-threshold"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ApiName" = "save-metrics"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "4XXError"
      + namespace                             = "AWS/ApiGateway"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 3000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.metrics_api_gateway_500_errors_above_threshold must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "metrics_api_gateway_500_errors_above_threshold" {
      ~ alarm_name                            = "metrics-api-gateway-errors-above-threshold" -> "metrics-api-gateway-500-errors-above-threshold" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:820252213580:alarm:metrics-api-gateway-errors-above-threshold" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "metrics-api-gateway-errors-above-threshold" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (12 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary"

Releasing state lock. This may take a few moments...
```
</details>